[
  {
    "title": "Anki for internalization of nuggets of wisdom",
    "file": "/articles/2024-03-11-anki-for-internalization-of-nuggets",
    "date": "2024-03-11T00:00:00.000Z",
    "tags": [
      "productivity",
      "learning",
      "spaced-repetition"
    ],
    "categories": [
      "musings"
    ],
    "content": "<hr>\n<p>title: &quot;Anki for internalization of nuggets of wisdom&quot;\ndate:   2024-03-11 \ncategories:\n    - musings\ntags:\n    - productivity\n    - learning\n- spaced-repetition</p>\n<hr>\n<p>Anki is a spaced repetition software that allows users to process a large amount of information into long term memory in the most efficient manner. It is best known for vocabulary memorization for languages and for medical students for their studies. But I believe that is limiting the scope of Anki to a very small group. I’d argue that this tool is one that’s able to be utilized throughout one’s life for accelerated learning.</p>\n<p>Today I’d like to talk about it’s applications for internalizing nuggets of knowledge. This is something that I’ve seen happen within my own life, but have not seen talked about much elsewhere. It all started with the idea of, “hey it’d be cool to know a few stoicism quotes.” Over a period of a few months I’ve realized that this has changed the way that I’ve interpreted experiences in my day to day life.</p>\n<p>Let me tell you about an example first so it’s better illustrated in your mind’s eye and then I’ll get on with the macro level application.</p>\n<p>Me and the boys who got broken up with a while back, used to talk about misery and heartbreak quite a bit. I’ve sadly not felt as deeply the ache as some others and that always sort of made me feel like an outsider. One of those days I’d gotten an anki card for a quote that (paraphrased) goes, ‘You may have emotions but you don’t need them to affect your soul.’ I’d even done the card a few times without it registering until one day when the line just connected with the experience and became internalized. Internalized in the sense that I think of the quote in my head whenever I have this conversation now, and it makes me feel as if I do have a place in the conversation. I’ve felt the emotions too, they haven’t affected my soul.</p>\n<p>The sob story above is an illustration of the power of this style of anki for quotes. Usually when you do cards your brain only remembers it in that context. Only when you start to associate to other contexts do you start seeing it’s many applications. This is true in reverse as well. Even if someone teaches you a lesson unless it’s a painful lesson, you don’t actively remember it. You might even forget those pearls of wisdom along the passage of time. Anki for the purposes of this article acts as a bridge for the former case.\nBecause you have the contents of the card in the front of your short term memory, you’re more likely to remember it when you’re processing a situation or event having around you. Once you remember and associate the event to the card, the card holds more significance and is likely to be remembered in similar contexts in the future. You’re literally creating an abstraction (shorthand for you non-programmers) for referring to a situation along with the best way to deal with it. You’re also able to remember it better because of the deeper mental association, which is a side benefit.</p>\n<p>Anki provides this benefit for a trivial cost. The input of a card even if you didn’t download someone else’s deck is trivial. Only a minute or three. If you’re batch inputting cards then that cost decreases further. Reviewing the card also only decreases as the repetitions increase. Maybe from a minute to thirty seconds to twenty-ish seconds. Since it’s a long ass sentence further decrease is unlikely. (Note- I know the purists out there will likely talk about ‘ATOMIZE mon cards’, but meh, I’ll take the hit to peak productivity with this one).</p>\n<p>To summarize, with the way that we have a way to rapidly increase the frequency of hits that can occur for an association between a situation and a nugget of wisdom for what amounts to a trivial time cost, I believe getting on the anki train to go through quotes and learning them is a ‘quick’ way to acquire wisdom. (Note- Of course it still isn’t quick because there’s a need for the situations to occur, and for you figure out how to apply each of those nuggets to enough situations that it becomes an automatic response. But no one claimed that becoming wise was a three month long process)</p>\n"
  },
  {
    "title": "Life is iterative",
    "file": "/articles/2024-03-12-life-is-iterative",
    "date": "2024-03-12T00:00:00.000Z",
    "tags": [],
    "categories": "musings",
    "content": "<hr>\n<h2>title:  &quot;Life is iterative&quot;\ndate:   2024-03-12 \ncategories: musings</h2>\n<p>Life, barring tragedy, has about 60 solid years for me. It’s easy to forget that. Everything that I work on, I can over time improve. There’s magic there that I usually forget. Anything you can do, doesn’t need to be finished in one sitting, or done in only the ‘perfect’ way. This is a trap for never really starting and the solution is to live iteratively. Everything is one experience that you can come back to improve on the next iteration. </p>\n<p>It’s easy to believe that the first time you need to do something, you need to find the best, most optimized way to go about it. If you want a better body you need to get the 5 time IFBB pro bodybuilder’s routine. To learn to code, you need to find the best resources and the most optimal path to reach the goal. And in believing these, we miss out on the only thing that matters: action. Actually sitting your butt down on the chair and writing out the words. If you understand that life is iterative, you can find a lever to get you unstuck.</p>\n<p>Social Media has created the anxiousness that leads to this chase for optimality. All these tiktok reels of 20 year old millionaires and instagram videos of amazing works of art. The video of their first service job, and their stickman drawing is buried under their dazzling masterpieces. This isn’t throwing shade at them mind you, they’ve worked long and hard enough to reach greatness, they can flaunt all they want. But for the average user, the digital world that shows that everyone around them is achieving so much creates anxiety within. </p>\n<p>The answer then is to build on your dreams iteratively. Movies have us believing there’s this one seismic event that triggers a montage of self-improvement after which we live forever happy after. But that just isn’t true for most people, the average age of a forbes founder is 50 something. Everything is glamorized and the end product is shown but the journey is speedrun-ed. In twenty years these first works will amount to just one second of the highlight reel for those watching. Adopting the ‘I’m in this for the long haul’ is the way to go. </p>\n<p>Let’s take the idea of starting this blog. Yesterday’s post was on a page that doesn’t even load, you could only open it through the homepage header. The content seems to be in .md and that makes all of my careful 7 lines of CSS moot for readability. But here I am writing another post, and fixing just a little bit of the site today as well. And on it will go as long as I can go. There probably won’t be any readers for another year, there won’t be followers of the niche blog for a couple more, and I might not be able to pass the critical threshold to reach the mainstream ever. So why worry if this isn’t perfect. Just a little improvement everyday and it’s likely that I’ll be able to get this up to snuff someday. </p>\n<p>Long blog problems aside, knowing life is iterative means that you can make it a game to find a new spot to improve on every time. That maybe adding a new feature, or finding out a new macro. All the greats had their own workflows that were tailored to them. They all have their little nuggets of wisdom that they gained over the years by working on their craft. That’s something you gain only when you do the work. If you are, then doing the work anyway with an attitude of play would of course be better than feeling anxious that you might’ve missed out on the most optimal way.</p>\n<p>There’s a stoic quote that goes, ‘The man who is putting the finishing touches on his life everyday is never short on time.’ That fits into this idea of an iterative life, because in each iteration your only focus is on doing what you are right now to the best of your abilities. And the next day put the next finishing touch. This allows you to not have regrets because each iteration is still done. You just add and build on top of what already exists.</p>\n<p>Iteration allows you to enjoy momentum. If you think of each step as a chain that leads you to an end goal, instead of just a series of individual, isolated steps then you’re able to feel meaning by working on things. The video you clicked is not just a video, but one of many that builds into volumes. That speech is the first of many to reach greatness. Not all of it is great but you’re building on the last iteration and that makes you feel as if you’re working towards something. This is meaningful and is what creates joy in a world where everyone is unsatisfied and filling their lives with the next consumer item. </p>\n<p>With every work that I’ve been doing recently, the concept has stuck. My father used to put the water bottle on the stairs leading to our room once filled. The trip would be just a minor detour. When he was done working downstairs and is heading upstairs, the work is half done and he only needs to carry it to the room. I think about those moments and smile, “iterate”.</p>\n<p>(Note-I feel like Moody with how I’m preaching for “Constant Iteration!!!” (Iterative Note lol- maybe I should put in images and oooh memes))</p>\n<p>You pass yourself an alley-oop when you iterate. Like the story above, every time you iterate, and then come back to it, you’re grateful to your past self for doing just that little extra. It’s self-love in how you’re looking out for future you, and that little bit of compassion starts an upwards spiral of compassionate action. </p>\n<p>Iteration then is your cure for procrastination. Since each iteration can be just a little thing like filling the water bottle for tomorrow morning, or just laying out your clothes for the day before you hit the shower, there’s little friction towards actually doing it. You do just the little bit for you and the rest will be done in the next iteration. This reduces the ‘monumental’ effort that folding your clothes actually takes, and more often the compassion loop has you organically doing the whole task to help your future self along. </p>\n<p>In conclusion, it’s easy to forget that you’ve got more than a couple of decades to live and that leads to a feeling of anxiousness. Even in day to day, the urge that you have to go from a zero to a hundred with no in between can lead to the sheer proportion of projects to feel overwhelming. The solution is to view it as an iterative process where you’re work is just a base to improve on the next iteration. </p>\n<p>(Note- Might be best to take a shot every time I used the word iteration heh)</p>\n"
  },
  {
    "title": "Turn on greyscale",
    "file": "/articles/2024-04-07-turn-on-greyscale",
    "date": "2024-04-07T00:00:00.000Z",
    "tags": [],
    "categories": "musings",
    "content": "<hr>\n<h2>title:  &quot;Turn on greyscale&quot;\ndate:   2024-04-07 \ncategories: musings</h2>\n<p>I’ve been using greyscale almost full time on my phone these days and keep it on, on my laptop it’s more of a miss at the moment. Mostly because I haven’t made it automatic (changed since I started writing this article). I just realized that these days I don’t even remember if the greyscale is even on. That’s a pretty good achievement and here I’d like to explain why you should at least give greyscale a try.</p>\n<p>Our attention span is fucked. Social media has been vying for our attention. One key thing that is used to do this is color. Think about it, all major restaurant brands have the color red. All of the notification bubbles that have the color red too. The edits done to highlight the color and animations when you do certain actions. ‘What is the problem with this?’ you may ask.</p>\n<p>Are you enjoying the content or the color behind it? If your attention is directed into a piece of content only because of the way that it is displayed then were you there for the content, or there because you followed the colors like a cat chasing a laser beam. This could explain why we sometimes go on twenty minutes doom scrolls and come out wondering what I did the last twenty minutes.</p>\n<p>Grayscale can train our attention spans. Grayscale allows you to remove all color, and change it into tones of black and white which greatly reduces the depth of colors. This makes the screen very boring to look at. Why? Because of the virtue that all pages are optimized for color, it appears much less appealing when in grayscale. This makes us try harder to read content on the screen, instead of getting our enjoyment from the colors on it. Of course this might be different for artists, but for me, either I read the damn content on the page, or I don’t and realize that I didn’t want to anyway. There’s less distractions on there to move my attention.</p>\n<p>Grayscale allows you to stop scrolling media mindlessly. Open up your app with grayscale and mindlessly binge your feed. You’ll realize that a lot of the satisfaction of the habit is gone. Taking a page from Clear’s book one of the things that makes you repeat a habit is the satisfaction you feel when you do it. Since this is reduced during the whole process you’re able to detach and make the habit less likely. </p>\n<p>With that we reach the end of this one. Give grayscale a try. It’s usually better to say fuck it and not turn it off when you need to look at a picture. </p>\n"
  },
  {
    "title": "The unfair advantage of keyboard shortcuts",
    "file": "/articles/2024-04-20-the-unfair-advantage-of-keyboard-shortcuts",
    "date": "2024-04-20T00:00:00.000Z",
    "tags": [
      "productivity"
    ],
    "categories": [],
    "content": "<hr>\n<p>title: &quot;The unfair advantage of keyboard shortcuts&quot;\ndate:   2024-04-20 \ncategories:\ntags:\n- productivity</p>\n<hr>\n<p>The unfair advantage of keyboard shortcuts </p>\n<p>A keyboard press takes 300ms. A mouse movement from one position to another then the press takes about 3 seconds. This is the biggest reasons why we should all learn more keyboard shortcuts. Since we’re all going to be using keyboards and mouses for another 30-40 years, these micro losses of time adds up over time. These results in a loss. Of course there’s the argument that it wouldn’t have mattered anyway, the average user wouldn’t be typing that often either. The delays don’t really matter. Read on. </p>\n<p>Flow is a key ingredient in any creative endeavor. This is proven via numerous studies. One key ingredient that is necessary to achieve this is when you are in a state of complete mind body synergy. When the words flow out from your brain straight onto your paper. Little micro interruptions will have us breaking this flow, which never lets us truly stay in the state. You can’t enjoy a walk when you’re having to calculate how to put one foot in front of the other. At least not in the sense that you’ll freely be able to use the time to work on problems via dis-associative thinking. This is a big problem even if the above efficiency problem doesn’t exist.</p>\n<p>Keyboard shortcuts are a virtuous cycle. The first app that you learn shortcuts for will take a bit of time, as there’s a bit of a learning curve to remember a large variety. But as you move to another application a lot of those shortcuts carry over. The ctrl+t for a new tab, and ctrl+n for a new file. The ctrl+s for saving and on it goes. There’s also the ability to modify shortcuts when some don’t align with the ones you are already adept at. This means that especially with apps that are part of the same suite like Microsoft Office, or range of OSS like the suckless project. </p>\n<p>Macros do the above but on a whole new plane. A macro is simply a series of steps that the computer automatically does when the trigger sequence is pressed. For example with cleaning data where you need a specific sequence to delete. </p>\n<p>This leads further into the deep end. As you learn shortcuts it is easier to resonate with quicker software such as the command line or a windows tiling manager. The ability to use software made with the express intent of working to deliver results quickly. Every coder has at least heard of Vim and most of the users swear by it productivity wise. With all of these apps, the key component is a further use of shortcuts to really elevate the workflow into a highly productive retreat. By engaging in the habit of opting for the keyboard more, it’ll allow for introduction of these tool-chains without a large barrier for entry.</p>\n<p>In conclusion, this all does come down to you. You could just use your mouse and avoid having to learn more. But it’s absurd to someone from the other side. Like a touch typist looking at someone who’s typing each letter by clicking the corresponding button with a mouse on a virtual keyboard. It’s not for everyone, but the you in a few years just might thank you for it.</p>\n"
  },
  {
    "title": "Meditation as a warm-up",
    "file": "/articles/2024-07-23-meditation-as-a-warm-up",
    "date": "2024-07-23T00:00:00.000Z",
    "tags": [],
    "categories": [],
    "content": "<hr>\n<h2>title: &quot;Meditation as a warm-up&quot;\ndate:   2024-07-23 \ncategories:\ntags:</h2>\n<p>Meditation as a warm-up</p>\n<p>The American President Lincoln when asked how he’d go about the task of felling a tree in 15 hours, said, “I’d spend 14 of them sharpening my blade.” It has been observed that with the rise of TikTok there has been a sharp degeneration in the Pre Frontal Cortex (PFC), which is the part of our brain that makes us not give in to the desires of our lizard brain. What is a way to actively increase the PFC? Meditation. Through this article I’d like to establish a case for why meditation is the equivalent of a warmup for your brain before you get into a cognitively demanding activity like learning. </p>\n<p>Open Instagram, refresh Twitter feed, load 3 different YouTube videos, look through Facebook notifications. Repeat. That is the cycle of the average worker when they’re procrastinating on the internet. We are constantly flitting between these different algorithmic gods, hoping that, this next time is when they’ll reward us with something we find mildly amusing or interesting. </p>\n<p>This constant flitting of attention carries over to when we wish to actually sit down and work for a few hours. Given that the brain always succumbs to the easier of multiple approaches and that dopamine arrives without context, of course we’re tricked into having ‘just one quick look’ at our twitter feed 5 minutes into the work session. That’s the more ‘stimulating’ option. </p>\n<p>We do not have moments of silence, where we just do nothing. All of our thoughts regarding all the content we have consumed is in the background of our brain waiting to be processed. That’s like trying to work on a resource intensive task when your RAM is clogged up with bloatware. You’re not going to be able to get anything done in a reasonable period of time. </p>\n<p>Athletes always warm up before getting into a bout of activity. This is done to get the blood rushing, and the muscles loose and limber. It also allows the athlete to get into the correct headspace. To disassociate from the troubles of the day and hone in their focus onto the task at hand. Even for the regular joe, a warmup is always recommended before you do any type of lifting. To allow the body to work up to 100% and get in the zone in a safe way instead of just rushing into it. </p>\n<p>Meditation allows us a respite from the troubles of the day. Our life is filled with superstimuli. Our days passed in a haze, recovering from what we threw at it before. In eastern martial arts, we’ve seen the artists having to meditate before they swing their sword or perform the kata. To remove the kinks that have crept in throughout the day. The arguments with a partner, the deluge of information floating in the crevices of your mind. By meditating, we give our brain the chance to get rid of all this baggage at least for the time being. </p>\n<p>We’re frustrated by all the distracting thoughts that we have while we’re getting down to do work. The errand, the idea, the need to check for an update. It’s all bloatware that’s clogging up the system. By first allowing a bout of meditation, you’re letting the shitty tap run out all the scummy water. Sometimes you’ll just need to wait a few minutes to let it all out, on others it may take a while. You might even have the scummy water come out in between bouts of clean water. But by meditating you give yourself the opportunity to at least reduce the bloat. </p>\n<p>We’ve made giving in to impulses our default state. When we say we’re distracted by all the junk websites on the internet, in reality it’s our brain that’s become ready to give in to the distraction. While meditating, all we do is focus on the breath and nothing else. There’s an itch that starts creeping around, a train of thought you wish to explore immediately, but the goal is to keep focus on the breath. If we’ve drifted away, then to simply bring our attention back to it. This is literally just practice for all the temptations that arise when you’re connected to the internet. To feel the urge to open Twitter, then to simply bring your attention back to the task at hand. </p>\n<p>Better to spend some time sharpening the axe before you start felling the tree. If we believe we’re average mentally, then why would we not improve our chances at playing with ease and focus by warming up first. It is not a sign of weakness, just a tactic to overcome some of the baggage that modern life provides. By meditating we’re able to practice staying focused at the task at hand, while learning to bob and weave past the distractions. A sandbox to play and practice building sandcastles before moving to concrete things in reality. </p>\n"
  },
  {
    "title": "Get your hands dirty with chatgpt",
    "file": "/articles/2024-07-25-get-your-hands-dirty-with-chatgpt",
    "date": "2024-07-25T00:00:00.000Z",
    "tags": [
      "productivity"
    ],
    "categories": [],
    "content": "<hr>\n<p>title: &quot;Get your hands dirty with chatgpt&quot;\ndate:   2024-07-25 \ncategories:\ntags:\n- productivity</p>\n<hr>\n<p>Get your hands dirty with chatgpt</p>\n<p>“If I have seen further, it is by standing on the shoulder of giants,” wrote Isaac Newton long ago. With the rise of ChatGPT, we’ve heard heralds talk about the loss of the job market, and people skiving work by passing it off to these LLMs. But here I’d like to propose an alternate idea that many have not implemented. The use of ChatGPT as an skilled assistant, while you supervise, stumble and learn along the way. </p>\n<p>A skill that you keep working on gets easier over time. You can tolerate more variables as each becomes known to you. Like when driving a car, the newbie will be scared shitless driving on the road for the first time. Measure the distance from the cars to the left, right and front. Keep the speed at a constant. Be ready for jaywalkers and people who don’t turn on their turn signals. Don’t stall the car while changing gears. All of these are cheap cognitively for the experienced driver as a lot of it is processed in the background. What if we could short circuit this process for ourselves. To have a second brain that’ll manage variables and do the processing for us?</p>\n<p>A worker’s job description is never just one thing. He has to maneuver his way around multiple responsibilities. Indeed as you progress through the ranks of the corporate ladder, the need to be an ‘all-rounder’ is ever greater. But the friction towards starting to learn a new tool is chafing. As we work on learning a secondary skill that’s not necessary but nice to have, say scripting, the traditional method is one where only the passionate or the desperate will follow through to be adept at. The rest will waffle at the sheer magnitude of variables that they don’t know how to address and give up much too early. </p>\n<p>By using ChatGPT we’re able to painlessly dip our finger into the cookie jar. To create something satisfying that should’ve been out of reach. You can quickly start learning a skill in parts and get a lay of the land so to speak. Focus on one part, while ChatGPT builds the rest. Repeat this over multiple builds and you can see what all is the common jargon and boilerplate to know, and what idiosyncrasies that skill has. This allows you to take your newfound comprehensive abilities to then, look at and appreciate others who are skilled at the work. To look through GitHub repos, and then consume even more works that are actually meaningful. The ability to start walking quickly without months of having to crawl first. </p>\n<p>With the use of ChatGPT we’re able to get instant gratification. We’re able to build things a magnitude greater than what our skills would otherwise allow. To build small things that are immediately usable to solve real life problems. Even more impressive is the use of what is usually industry standard code. No need to worry about the line indents, commas and other trivial code. This gratification of getting to wear the big boy pants translates to a positive feedback loop. You get hooked into the thing you’re learning and start building more and becoming more ambitious. </p>\n<p>Learning in reverse becomes more fun. As a result of having built something that feels meaningful, instead of yet another soulless tutorial project that everyone else builds, you are more likely to feel an investment in the learning because you can see the potential. Now reverse engineering becomes a contextual puzzle. You already made it work, you just need to figure out how. Like all those appliances you opened, or devices you jailbreaked back when you were a kid. You know what steps you took and why, but the guts you need to understand next. Of course, if you stumble you’ve got the documentation to look at, or just ask chatGPT about that too. </p>\n<p>The sandcastle has already been built. Now, you need to understand how it stands strong, so that you can do it again but bigger and better. But like any civil engineer will tell you, the foundation is the most important. You can’t endlessly pile sand and expect the castle to stand tall and stable. Yes, you built the project with chatGPT, but you don’t understand most of it. As we move through the ranks and work on larger, more complex projects if we don’t have the ability to understand anything that’s written then our castle can’t expand without the risk of collapse. You’ll tell it to try a solution, it’ll make an irrelevant change, you’ll tell it to make the change again and a fruitless cycle ensues. You can’t make ChatGPT your only source of expertise, it can only be your worker. </p>\n<p>ChatGPT allows for you to create things beyond your fledgling skills. As a result you’re able to intimately feel the potential that the skill offers. You’re able to peek much further into the horizon as a result of having stood on the shoulder of ChatGPT. You get to play around like a kid, making whatever you want to, and learn through experimentation. That’s the true power for us newbs. But ChatGPT isn’t a shortcut, you still have to learn it all yourself to be able to see that horizon standing on your own two feet. The giant is only a way for you to visualize the potential you have yet to actualize. </p>\n"
  },
  {
    "title": "Divide work into palatable chunks",
    "file": "/articles/2024-08-01-divide-work-into-palatable-chunks",
    "date": "2024-08-01T00:00:00.000Z",
    "tags": [
      "productivity"
    ],
    "categories": [
      "musings"
    ],
    "content": "<hr>\n<p>title: &quot;Divide work into palatable chunks&quot;\ndate:   2024-08-01 \ncategories:\n    - musings\ntags:\n- productivity</p>\n<hr>\n<p>Divide work into palatable chunks</p>\n<p>We’ve heard of, ‘just keep putting one foot in front of the other and you’ll be surprised by how far you’ve come.’ Or more likely the modern version of this, ‘I just opened this one reel and the next thing I know I already spent an hour there.’ It’s amazing how easily we understand this, but then won’t think of leveraging this into our more noble pursuits. Imagine saying this line for meditation or studying. We’d think of people who say that as either showoffs or geniuses. Well I can probably make you the first if you give the idea in this article an honest try.</p>\n<p>We assume that we can only do all or nothing. To do all the dishes or do it later. To do all the questions on the problem set or none at all. To marathon on day one instead of just getting off the couch. But wait, with stuff we ‘fall’ into it’s divided into chunks for us. No one decides to binge all of Hunger Games, or 12 hours of the extended cut of LOTR. We just believe we’ll watch one more, and another until, surprisingly it’s two in the morning and you’ve finished the twenty hour YouTube marathon. But is there really any difference between these two types of activities? Not really. Anything can be made into a palatable chunk. You could’ve done only two dishes and moved on with your day. You could’ve done one problem and gone to go do another dish or two. But we don’t. A need for completion of what we’ve started when it comes to things that aren’t already neatly packaged into palatable chunks is what’s ruining us. </p>\n<p>We’re raging perfectionists. An attitude of all or nothing guides us along. The lies of saying, “Clear talked about only doing 5 pushups, that’s what I’ll do,” while actually believing you’ll do more after the five. All of it makes us not want to do it in the end. A false palatable chunk. Like lying to a clever kid saying, ‘you just need to eat this one bite,’ but then saying that with every subsequent bite. They all wizen up eventually. This false rhetoric to the self is yet another reason why you don’t actually have palatable chunks for things you actually want to do. If you want this concept to work as easy as going through YouTube shorts you need to get rid of the sneaky falsities you’re trying to slide in.</p>\n<p>A palatable chunk is easy to digest. It should be so easy you could do it half asleep, or while you’re hungover. This is the foundation of being able to breeze through it: actually making it a breeze. We could all do a minute of meditation. Two minutes of folding clothes. Three minutes of cleaning our room. That’s how easy it should be. An atomic action with a clear stopping point. By making it so easy to digest you don’t set yourself up for evasive procrastination by dreading doing the thing, and then proceeding to wallow in your dread. But then what, why’d I want to stop then?</p>\n<p>The ability to just walk away is crucial. Once that time is up you need to have full autonomy of what you do next. You could choose to do another appetizing portion, but you need the choice. You can’t make it an MLM scheme where you’re strung along with hidden clauses. Your brain may want you to stay for a while longer. But if it doesn’t, it’s better to just walk away. It’s like how Hemingway said, “When you are going good, stop.” That stopping is what will make you want to come back for more. We prefer a clear stopping point, but stopping in the middle of a word that’s in the middle of a sentence that’s in the middle of an essay that’s in the middle of a session you’re enjoying will drive you nuts. You’ll beg to be coming back. This is a part of the secret sauce that’ll keep you coming back: the cliff hanger of a good ending. </p>\n<p>A palatable chunk is by definition appetizing. Having had one you wish to have another, like a cookie after another. And that’s when you reach the true magic. Each chunk gives you a hit of happiness or more likely fulfillment, which makes you want to do it more, and the tension of having stopped while it was going good combines together to start a virtuous cycle in your favor. Feedback loops of short form content use exactly this very strategy. They replace the fulfillment with pleasure which is why it is nowhere as satisfying in hindsight but the feeling of, ‘so easy I just did another’ is still there. TV series constantly leave setups through the story that have us waiting for that oh so sweet payoff. Leveraging these is our goal. </p>\n<p>The palatable chunk is easy to fall into. Once you set it up and see the benefit you should just be able to drop into it whenever. To do a pushup and move on with your day. The pushup shouldn’t be anywhere near hard for you. Anchor it to an activity, like every time you walk into a room and soon you’ll be hitting 20 sets. At 5 pushups each time you’d be doing a 100 everyday, with each ‘set’ being barely an inconvenience. By virtue of being appetizing you can even chain them one after another into a binge session if you feel like it. The first dragging you into the second, then the third until an hour has gone by almost like magic. This idea goes on steroids when you make a palatable chunk so trivial that between that and replying to ‘one’ (it’s never only one) message you’d actually choose the chunk. Imagine that, the idea that learning an anki card or two being preferred over a quick text or look through your feed. That’s why you need to chase satisfaction, it’ll almost always beat cheap pleasure.</p>\n<p>Games are an excellent analogy. Think of it as a one off videogame like Asteroids or Tetris. Each run through is what would be a palatable chunk. And it’s pretty easy to play a new game and try to win, or last longer. We know of a lot of mini-games that are used in real life too. Tiger Woods used to play by shooting golf balls into the laundry basket. Joe Simpson crawled back to camp after falling down a mountain’s crevasse by playing a game of seeing if he could reach that next spot within an allotted time. We can replicate this too by dividing our tasks into palatable chunks that we keep playing like games. </p>\n<p>Our attention span is fucked. Ain’t no way we’re doing 25 or 50 minute pomodoros for every aspect of our life and feeling joy throughout it all. There’s a reason why all of content has only been becoming shorter. We’ve been training our minds to prefer shorter tasks with instant gratification. By pitting what’s already been trained into our very deep mental grooves with a new pattern that won’t be likelier to be chosen we’ve set ourselves up for failure. So it is better to jury-rig the groove to default to doing virtuous activities for those same bursts. Then to eventually train ourselves to string along these bursts. It’s empowering to be able to fall into something you find fulfilling but dread doing simply by making the process appealing to your brain. But that can’t be done when you’re trying to fix everything, from your attention span to your habit of defaulting to the cheap pleasures, all at once. </p>\n<p>There were a few ideas sprinkled here, along with systems like Timeboxing that I’ll discuss some other day that make this easier to wrap your head around. But honestly the only thing that’ll make you get this is actually going out and trying appealing portions of work at a time. Go do just a few dishes, and walk away. Let yourself feel the satisfaction of having started and the itch of wanting to do the rest. Relish in that feeling of feeling both the pleasure and the pain, you kinky reader. You know you’ll come to like it ;). A few tries later, add another chunk to the chain. Until someday you can showoff how you meditated for two hours without even realizing. </p>\n"
  },
  {
    "title": "On using scrcpy",
    "file": "/articles/2024-11-12-on-using-scrcpy",
    "date": "2024-11-12T00:00:00.000Z",
    "tags": [
      "app development"
    ],
    "categories": [
      "devX"
    ],
    "content": "<hr>\n<p>title: &quot;On using scrcpy&quot;\ndate:   2024-11-12 \ncategories:\n    - devX\ntags:\n- app development</p>\n<hr>\n<p>Don&#39;t look down, you tech-neck mouth breather. We&#39;re all already suffering from bad posture while working on our desks all day. I present to you scrcpy.</p>\n<p>scrcpy give you the screen mirroring. While working on our apps, us mobile developers suffer from the problem of having to make a trade-off between bending over to look at our phone or use an emulator that our 4 GBs of RAM can barely handle half the time. Those damn web developers get to split the screen in half and check everything in real time. Well no more I say. scrcpy brings in an interesting middle ground that I&#39;ve come to enjoy these last few weeks. Because you&#39;re able to mirror your screen while designing the UI, you get to see the changes made in real time. No more bad posture. No more binging on your phone when you get the chance because we just have to check up on something while testing your app. Now you get to binge consciously and feel guilty throughout. </p>\n<p>scrcpy allows you to type with all 10 fingers while you fill out yet another damn form. scrcpy allows for you to use your mouse and keyboard as usual. This allows testing to go by so much faster. Stuff like using ctrl + alt + arrows to move through the screen and never take your hand off the keyboard.</p>\n<p>There&#39;s a thousand guides to set it up, and there&#39;s a lot of different uses for it too. Look it up and go try it out. Once you&#39;re done every other time only takes like 5 seconds to load. You could literally load and get it ready in the time your editor is loading everything about your project. Connect your phone via USB or wifi, enter scrcpy into your terminal, move the mirrored screen to sit besides your code editor. </p>\n<h3>Resources</h3>\n<p><a href=\"https://github.com/Genymobile/scrcpy/\">https://github.com/Genymobile/scrcpy/</a></p>\n"
  }
]